Autodesk.Revit.DB.WallUtils.IsWallJoinAllowedAtEnd(Autodesk.Revit.DB.Wall,System.Int32)
Identifies if the indicated end of the wall allows joins or not.
wall:
The wall in question
end:
0 or 1 for the beginning or end of the wall's curve
Returns:
true if it is allowed to join. false if it is disallowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallUtils.AllowWallJoinAtEnd(Autodesk.Revit.DB.Wall,System.Int32)
Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result.
Remarks:
By default all walls are allowed to join at ends, so this function is only needed if this wall end is already disallowed to join.
If this wall is a stacked wall, all subwalls at this end will be allowed to join.
wall:
The wall in question
end:
0 or 1 for the beginning or end of the wall's curve
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallUtils.DisallowWallJoinAtEnd(Autodesk.Revit.DB.Wall,System.Int32)
Sets the wall's end not to join to other walls.
Remarks:
If this wall is already joined at this end, it will become disconnected.
If this wall is a stacked wall, all subwalls at this end will be disallowed to join.
wall:
The wall in question
end:
0 or 1 for the beginning or end of the wall's curve
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallUtils
General Wall utility methods
Since:
2012